src/controllers/AdminController.php

    public function actionPages()
    {
        $userid=Yii::$app->user->identity->id;
        $model = Pages::find()->where(['created_by'=>$userid])->all();
---
SELECT * FROM `pages` WHERE `created_by`=1